# Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### Accuracy

In [25]:
df = pd.DataFrame({
    "name": ["Kevin"],
    "surname": ["McCallistera"],
    "address": ["Uchlejowo Dolne 35"]
})

df

    name       surname             address
0  Kevin  McCallistera  Uchlejowo Dolne 35

### Consistency

In [5]:
df = pd.DataFrame({
    "name": ["Kevin"],
    "surname": ["McCallistera"],
    "age": [13],
    "marital_status": ["divorced"]
})

df

    name       surname  age marital_status
0  Kevin  McCallistera   13       divorced

In [4]:
df = pd.DataFrame({
    "name": ["Kevin"],
    "surname": ["McCallistera"],
    # "address": ["671 Lincoln Avenue, Chicago"]
    "address": ["352 Lincoln Avenue, Chicago"]
})

df

    name       surname                      address
0  Kevin  McCallistera  352 Lincoln Avenue, Chicago

### Completeness

In [21]:
df = pd.read_csv("data/wina.pl_clean.csv")
df.drop([
    "name", "link", "region", "appellation", "vineyard",
    "grapes", "taste", "style", "alcohol (%)", "serving temperature (C)",
    "color"
], axis=1, inplace=True)
df.sample(5).reset_index(drop=True)

,price (PLN),country,vintage,volume (liters),kind,medals,wegan,natural,punctation
0,49.0,Argentyna,2021.0,0.75,NaN,NaN,False,False,NaN
1,75.0,Węgry,2019.0,0.75,NaN,NaN,False,False,NaN
2,99.0,Hiszpania,2018.0,0.75,NaN,NaN,False,True,NaN
3,1163.0,Francja,2019.0,0.75,NaN,NaN,False,False,NaN
4,128.0,USA,2018.0,0.75,NaN,NaN,True,False,NaN

In [24]:
df = pd.DataFrame({
    "name": ["Kevin"],
    "surname": ["McCallistera"],
    "address": ["Chicago, IL"]
    # "address": ["671 Lincoln Avenue, Chicago, IL 60614"]
})

df

    name       surname      address
0  Kevin  McCallistera  Chicago, IL

# Readability

In [4]:
df = sns.load_dataset("mpg")
df = df[["name", "weight", "horsepower", "model_year", "mpg"]]
df.rename(columns={"mpg": "col5"}, inplace=True)
df.head()

                        name  weight  horsepower  model_year  col5
0  chevrolet chevelle malibu    3504       130.0          70  18.0
1          buick skylark 320    3693       165.0          70  15.0
2         plymouth satellite    3436       150.0          70  18.0
3              amc rebel sst    3433       150.0          70  16.0
4                ford torino    3449       140.0          70  17.0

In [7]:
df = sns.load_dataset("mpg")
df = df[["name", "weight", "horsepower", "model_year", "mpg"]]
df.rename(columns={"mpg": "fuel_consumption"}, inplace=True)
df.head()

                        name  weight  horsepower  model_year  fuel_consumption
0  chevrolet chevelle malibu    3504       130.0          70              18.0
1          buick skylark 320    3693       165.0          70              15.0
2         plymouth satellite    3436       150.0          70              18.0
3              amc rebel sst    3433       150.0          70              16.0
4                ford torino    3449       140.0          70              17.0